
## Plan Result (pocket-event-bridge-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/21918)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 3 to change, 6 to destroy.</code></pre>

* Create
  * null_resource.user-api-events
  * null_resource.user-registration
  * pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5
  * pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C
  * pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23
  * pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197
* Update
  * aws_cloudwatch_metric_alarm.shareable-list-events_shareablelistevents-rule-dlq-alarm_FBCFA70C
  * pagerduty_service.pagerduty_pagerduty-critical_464EE7CD
  * pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938
* Delete
  * pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281critical_A02019A8
  * pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281noncritical_CDE4BAD7
  * pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78critical_3C026715
  * pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78noncritical_1E770FF0
* Replace
  * aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84
  * aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B
* Move
  * aws_cloudwatch_event_bus.pocketeventbridge_sharedeventbus_eventbusPocketEventBridgeProdSharedEventBus_5780345A => aws_cloudwatch_event_bus.shared-event-bus_event-bus-PocketEventBridge-Prod-Shared-Event-Bus_AA9ACCF5
  * aws_cloudwatch_event_rule.pocketeventbridge_admevents_PocketEventBridgeProdEventTrackerEventBridgeRule_eventbridgerule_85435BD0 => aws_cloudwatch_event_rule.adm-events_PocketEventBridge-Prod-EventTracker-EventBridge-Rule_event-bridge-rule_5E518227
  * aws_cloudwatch_event_rule.pocketeventbridge_admevents_PocketEventBridgeProdUserMergeEventBridgeRule_eventbridgerule_9306063C => aws_cloudwatch_event_rule.adm-events_PocketEventBridge-Prod-UserMerge-EventBridge-Rule_event-bridge-rule_6FA6D274
  * aws_cloudwatch_event_rule.pocketeventbridge_collectionevents_PocketEventBridgeProdCollectionApiEventBridgeRule_eventbridgerule_9790D0EF => aws_cloudwatch_event_rule.collection-events_PocketEventBridge-Prod-Collection-Api-EventBridge-Rule_event-bridge-rule_D5C5DE9D
  * aws_cloudwatch_event_rule.pocketeventbridge_listapievents_PocketEventBridgeProdListApiEventBridgeRule_eventbridgerule_AD82EC14 => aws_cloudwatch_event_rule.list-api-events_PocketEventBridge-Prod-List-Api-EventBridge-Rule_event-bridge-rule_AFDFFFC6
  * aws_cloudwatch_event_rule.pocketeventbridge_premiumpurchase_PocketEventBridgeProdPremiumPurchaseEventBridgeRule_eventbridgerule_E1ED50AF => aws_cloudwatch_event_rule.premium-purchase_PocketEventBridge-Prod-PremiumPurchase-EventBridge-Rule_event-bridge-rule_ECCD1C94
  * aws_cloudwatch_event_rule.pocketeventbridge_prospectevents_PocketEventBridgeProdProspectDismissProdEventBridgeRule_eventbridgerule_8EF4DF44 => aws_cloudwatch_event_rule.prospect-events_PocketEventBridge-Prod-Prospect-Dismiss-Prod-EventBridge-Rule_event-bridge-rule_758CF81E
  * aws_cloudwatch_event_rule.pocketeventbridge_prospectevents_PocketEventBridgeProdProspectProdEventBridgeRule_eventbridgerule_BE199BDE => aws_cloudwatch_event_rule.prospect-events_PocketEventBridge-Prod-Prospect-Prod-EventBridge-Rule_event-bridge-rule_D94A5C82
  * aws_cloudwatch_event_rule.pocketeventbridge_shareablelistevents_PocketEventBridgeProdShareableListEventBridgeRule_eventbridgerule_C3B1C5AD => aws_cloudwatch_event_rule.shareable-list-events_PocketEventBridge-Prod-Shareable-List-EventBridge-Rule_event-bridge-rule_B3E9B53D
  * aws_cloudwatch_event_rule.pocketeventbridge_shareablelistitemevents_PocketEventBridgeProdShareableListItemEventBridgeRule_eventbridgerule_D85AA479 => aws_cloudwatch_event_rule.shareable-list-item-events_PocketEventBridge-Prod-Shareable-List-Item-EventBridge-Rule_event-bridge-rule_8124CBA8
  * aws_cloudwatch_event_rule.pocketeventbridge_userapievents_PocketEventBridgeProdUserApiEventBridgeRule_eventbridgerule_95249B28 => aws_cloudwatch_event_rule.user-api-events_PocketEventBridge-Prod-User-Api-EventBridge-Rule_event-bridge-rule_4810C8AC
  * aws_cloudwatch_event_rule.pocketeventbridge_userregistration_PocketEventBridgeProdUserRegistrationEventBridgeRule_eventbridgerule_18E9DE51 => aws_cloudwatch_event_rule.user-registration_PocketEventBridge-Prod-User-Registration-EventBridge-Rule_event-bridge-rule_99FC7731
  * aws_cloudwatch_event_target.pocketeventbridge_admevents_PocketEventBridgeProdEventTrackerEventBridgeRule_eventbridgerule_eventbridgetargetAccountDeleteMonitorProdEventTrackerRuleTarget_5EAF513A => aws_cloudwatch_event_target.adm-events_PocketEventBridge-Prod-EventTracker-EventBridge-Rule_event-bridge-rule_event-bridge-target-AccountDeleteMonitor-Prod-EventTracker-Rule-Target_AF1CF51A
  * aws_cloudwatch_event_target.pocketeventbridge_admevents_PocketEventBridgeProdUserMergeEventBridgeRule_eventbridgerule_eventbridgetargetAccountDeleteMonitorProdUserMergeRuleTarget_3AA65A81 => aws_cloudwatch_event_target.adm-events_PocketEventBridge-Prod-UserMerge-EventBridge-Rule_event-bridge-rule_event-bridge-target-AccountDeleteMonitor-Prod-UserMerge-Rule-Target_7DE5DC1D
  * aws_cloudwatch_event_target.pocketeventbridge_collectionevents_PocketEventBridgeProdCollectionApiEventBridgeRule_eventbridgerule_eventbridgetargetPocketEventBridgeProdCollectionEventSNSTarget_E85BE39A => aws_cloudwatch_event_target.collection-events_PocketEventBridge-Prod-Collection-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Collection-Event-SNS-Target_C4E7E46F
  * aws_cloudwatch_event_target.pocketeventbridge_listapievents_PocketEventBridgeProdListApiEventBridgeRule_eventbridgerule_eventbridgetargetPocketEventBridgeProdListEventSNSTarget_D9175105 => aws_cloudwatch_event_target.list-api-events_PocketEventBridge-Prod-List-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-List-Event-SNS-Target_FD139C52
  * aws_cloudwatch_event_target.pocketeventbridge_premiumpurchase_PocketEventBridgeProdPremiumPurchaseEventBridgeRule_eventbridgerule_eventbridgetargetPocketEventBridgeProdPremiumPurchaseSNSTarget_BEBA381B => aws_cloudwatch_event_target.premium-purchase_PocketEventBridge-Prod-PremiumPurchase-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-PremiumPurchase-SNS-Target_A8F33A09
  * aws_cloudwatch_event_target.pocketeventbridge_prospectevents_PocketEventBridgeProdProspectDismissProdEventBridgeRule_eventbridgerule_eventbridgetargetPocketEventBridgeProdProspectEventSNSTarget_45FF665F => aws_cloudwatch_event_target.prospect-events_PocketEventBridge-Prod-Prospect-Dismiss-Prod-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Prospect-Event-SNS-Target_CC89DADA
  * aws_cloudwatch_event_target.pocketeventbridge_prospectevents_PocketEventBridgeProdProspectProdEventBridgeRule_eventbridgerule_eventbridgetargetPocketEventBridgeProdProspectEventDevEventBridgetTarget_DD25D56B => aws_cloudwatch_event_target.prospect-events_PocketEventBridge-Prod-Prospect-Prod-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Prospect-Event-Dev-Event-Bridget-Target_C4F47897
  * aws_cloudwatch_event_target.pocketeventbridge_prospectevents_PocketEventBridgeProdProspectProdEventBridgeRule_eventbridgerule_eventbridgetargetPocketEventBridgeProdProspectEventSQSTarget_5FB29389 => aws_cloudwatch_event_target.prospect-events_PocketEventBridge-Prod-Prospect-Prod-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Prospect-Event-SQS-Target_649F5585
  * aws_cloudwatch_event_target.pocketeventbridge_shareablelistevents_PocketEventBridgeProdShareableListEventBridgeRule_eventbridgerule_eventbridgetargetPocketEventBridgeProdShareableListEventSNSTarget_2CD4ED13 => aws_cloudwatch_event_target.shareable-list-events_PocketEventBridge-Prod-Shareable-List-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Shareable-List-Event-SNS-Target_D0F547B9
  * aws_cloudwatch_event_target.pocketeventbridge_shareablelistitemevents_PocketEventBridgeProdShareableListItemEventBridgeRule_eventbridgerule_eventbridgetargetPocketEventBridgeProdShareableListItemEventSNSTarget_2AE93962 => aws_cloudwatch_event_target.shareable-list-item-events_PocketEventBridge-Prod-Shareable-List-Item-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Shareable-List-Item-Event-SNS-Target_84030FFD
  * aws_cloudwatch_event_target.pocketeventbridge_userapievents_PocketEventBridgeProdUserApiEventBridgeRule_eventbridgerule_eventbridgetargetPocketEventBridgeProdUserEventSNSTarget_56DFA070 => aws_cloudwatch_event_target.user-api-events_PocketEventBridge-Prod-User-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-User-Event-SNS-Target_9A50990C
  * aws_cloudwatch_event_target.pocketeventbridge_userregistration_PocketEventBridgeProdUserRegistrationEventBridgeRule_eventbridgerule_eventbridgetargetPocketEventBridgeProdUserRegistrationEventSNSTarget_3AB833CC => aws_cloudwatch_event_target.user-registration_PocketEventBridge-Prod-User-Registration-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-User-Registration-Event-SNS-Target_D5B6ADE6
  * aws_cloudwatch_metric_alarm.pocketeventbridge_admevents_pocketeventbridgeproddlqalarm_7C10E75B => aws_cloudwatch_metric_alarm.adm-events_pocketeventbridge-prod-dlq-alarm_D899FDCA
  * aws_cloudwatch_metric_alarm.pocketeventbridge_collectionevents_collectioneventsruledlqalarm_D0F6DA6A => aws_cloudwatch_metric_alarm.collection-events_collectionevents-rule-dlq-alarm_9543404D
  * aws_cloudwatch_metric_alarm.pocketeventbridge_listapievents_listapieventsruledlqalarm_F5C18D51 => aws_cloudwatch_metric_alarm.list-api-events_listapievents-rule-dlq-alarm_9E16078F
  * aws_cloudwatch_metric_alarm.pocketeventbridge_premiumpurchase_premiumpurchaseruledlqalarm_54A7ABD7 => aws_cloudwatch_metric_alarm.premium-purchase_premiumpurchase-rule-dlq-alarm_912E47A2
  * aws_cloudwatch_metric_alarm.pocketeventbridge_prospectevents_prospecteventsruledlqalarm_0428D8ED => aws_cloudwatch_metric_alarm.prospect-events_prospectevents-rule-dlq-alarm_8841D120
  * aws_cloudwatch_metric_alarm.pocketeventbridge_shareablelistevents_shareablelisteventsruledlqalarm_2F345E4B => aws_cloudwatch_metric_alarm.shareable-list-events_shareablelistevents-rule-dlq-alarm_FBCFA70C
  * aws_cloudwatch_metric_alarm.pocketeventbridge_shareablelistitemevents_shareablelisteventsruledlqalarm_BC540655 => aws_cloudwatch_metric_alarm.shareable-list-item-events_shareablelistevents-rule-dlq-alarm_2CE4E6A3
  * aws_cloudwatch_metric_alarm.pocketeventbridge_userapievents_usereventsruledlqalarm_B2FD9FD2 => aws_cloudwatch_metric_alarm.user-api-events_userevents-rule-dlq-alarm_A6972B78
  * aws_schemas_schema.pocketeventbridge_forgotpasswordrequesteventschema_ForgotPasswordRequestSchema_4EC0A069 => aws_schemas_schema.forgot-password-request-event-schema_Forgot-Password-Request-Schema_F8AD6D8D
  * aws_schemas_schema.pocketeventbridge_premiumpurchaseeventschema_PremiumPurchaseSchema_DB9F9703 => aws_schemas_schema.premium-purchase-event-schema_Premium-Purchase-Schema_4B186F59
  * aws_schemas_schema.pocketeventbridge_premiumpurchaseeventschema_PremiumRenewalUpcomingSchema_4BD5EB24 => aws_schemas_schema.premium-purchase-event-schema_Premium-Renewal-Upcoming-Schema_8D7B8419
  * aws_schemas_schema.pocketeventbridge_queuedeleteschema_cron1510schema_24302433 => aws_schemas_schema.queue-delete-schema_cron1510-schema_D11DCA60
  * aws_schemas_schema.pocketeventbridge_userapieventsschema_usereventsschema_328CD894 => aws_schemas_schema.user-api-events-schema_user-events-schema_692DDC33
  * aws_schemas_schema.pocketeventbridge_usermergeeventshema_usermergeschema_9563BF72 => aws_schemas_schema.user-merge-event-shema_user-merge-schema_325E4B6B
  * aws_schemas_schema.pocketeventbridge_userregistrationeventschema_UserRegistrationEventSchema_1BDB0132 => aws_schemas_schema.user-registration-event-schema_User-Registration-Event-Schema_ABDCA1C3
  * aws_sns_topic.pocketeventbridge_admevents_usermergetopic_DEB7603D => aws_sns_topic.adm-events_user-merge-topic_59FD8EDC
  * aws_sns_topic.pocketeventbridge_collectionevents_collectioneventtopic_2974C8EE => aws_sns_topic.collection-events_collection-event-topic_343F754D
  * aws_sns_topic.pocketeventbridge_listapievents_listeventtopic_BC616D31 => aws_sns_topic.list-api-events_list-event-topic_8792A1B3
  * aws_sns_topic.pocketeventbridge_pagerduty_alarmcriticaltopic_9AC2FC17 => aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
  * aws_sns_topic.pocketeventbridge_pagerduty_alarmnoncriticaltopic_5D53E7FA => aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
  * aws_sns_topic.pocketeventbridge_premiumpurchase_premiumpurchasetopic_F377CBA5 => aws_sns_topic.premium-purchase_premium-purchase-topic_B49B01E4
  * aws_sns_topic.pocketeventbridge_prospectevents_prospecteventtopic_9280FCAE => aws_sns_topic.prospect-events_prospect-event-topic_59EF07AC
  * aws_sns_topic.pocketeventbridge_shareablelistevents_shareablelisteventtopic_4B2730C8 => aws_sns_topic.shareable-list-events_shareable-list-event-topic_0122F098
  * aws_sns_topic.pocketeventbridge_shareablelistitemevents_shareablelistitemeventtopic_8B9E00A4 => aws_sns_topic.shareable-list-item-events_shareable-list-item-event-topic_C6825838
  * aws_sns_topic.pocketeventbridge_userapievents_usereventtopic_9E64E1FA => aws_sns_topic.user-api-events_user-event-topic_BF85AC87
  * aws_sns_topic.pocketeventbridge_userregistration_userregistrationtopic_505053B5 => aws_sns_topic.user-registration_user-registration-topic_1A7AE012
  * aws_sns_topic_policy.pocketeventbridge_admevents_usereventssnstopicpolicy_13889830 => aws_sns_topic_policy.adm-events_user-events-sns-topic-policy_311E9FD7
  * aws_sns_topic_policy.pocketeventbridge_collectionevents_collectioneventssnstopicpolicy_09809F3F => aws_sns_topic_policy.collection-events_collection-events-sns-topic-policy_65FE0430
  * aws_sns_topic_policy.pocketeventbridge_listapievents_listeventssnstopicpolicy_FC1C0842 => aws_sns_topic_policy.list-api-events_list-events-sns-topic-policy_59B53E09
  * aws_sns_topic_policy.pocketeventbridge_premiumpurchase_premiumpurchasesnstopicpolicy_D8AD1C37 => aws_sns_topic_policy.premium-purchase_premium-purchase-sns-topic-policy_DDFFEF7C
  * aws_sns_topic_policy.pocketeventbridge_prospectevents_prospecteventssnstopicpolicy_F6F78D39 => aws_sns_topic_policy.prospect-events_prospect-events-sns-topic-policy_8C3D6AD1
  * aws_sns_topic_policy.pocketeventbridge_shareablelistevents_shareablelisteventssnstopicpolicy_387E1A3C => aws_sns_topic_policy.shareable-list-events_shareable-list-events-sns-topic-policy_1352CBFE
  * aws_sns_topic_policy.pocketeventbridge_shareablelistitemevents_shareablelistitemeventssnstopicpolicy_5A1FEF5D => aws_sns_topic_policy.shareable-list-item-events_shareable-list-item-events-sns-topic-policy_7C39759F
  * aws_sns_topic_policy.pocketeventbridge_userapievents_usereventssnstopicpolicy_EEB8C27E => aws_sns_topic_policy.user-api-events_user-events-sns-topic-policy_0B7C8128
  * aws_sns_topic_policy.pocketeventbridge_userregistration_userregistrationeventssnstopicpolicy_DE9F2864 => aws_sns_topic_policy.user-registration_user-registration-events-sns-topic-policy_15EC0C3C
  * aws_sns_topic_subscription.pocketeventbridge_pagerduty_alarmcriticalsubscription_5B282F58 => aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84
  * aws_sns_topic_subscription.pocketeventbridge_pagerduty_alarmnoncriticalsubscription_E2C2944C => aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B
  * aws_sqs_queue.pocketeventbridge_admevents_snstopicdql_43476306 => aws_sqs_queue.adm-events_sns-topic-dql_3950AFFB
  * aws_sqs_queue.pocketeventbridge_collectionevents_snstopicdql_6B11F7F7 => aws_sqs_queue.collection-events_sns-topic-dql_48DE5FA3
  * aws_sqs_queue.pocketeventbridge_listapievents_snstopicdql_0098EEA6 => aws_sqs_queue.list-api-events_sns-topic-dql_ED0C2F54
  * aws_sqs_queue.pocketeventbridge_premiumpurchase_snstopicdlq_1949C943 => aws_sqs_queue.premium-purchase_sns-topic-dlq_2D01673E
  * aws_sqs_queue.pocketeventbridge_shareablelistevents_snstopicdql_49BECACA => aws_sqs_queue.shareable-list-events_sns-topic-dql_91DFF5B3
  * aws_sqs_queue.pocketeventbridge_shareablelistitemevents_snstopicdql_D0F47B59 => aws_sqs_queue.shareable-list-item-events_sns-topic-dql_44435A2F
  * aws_sqs_queue.pocketeventbridge_userapievents_snstopicdql_A0F6EC9F => aws_sqs_queue.user-api-events_sns-topic-dql_D6161F53
  * aws_sqs_queue.pocketeventbridge_userregistration_snstopicdql_5EDA4814 => aws_sqs_queue.user-registration_sns-topic-dql_811A5411
  * aws_sqs_queue_policy.pocketeventbridge_prospectevents_prospecteventssqspolicy_B5651E17 => aws_sqs_queue_policy.prospect-events_prospect-events-sqs-policy_5D878A3E
  * null_resource.pocketeventbridge_admevents_nullresource_582607DC => null_resource.adm-events_null-resource_C7D19F6F
  * null_resource.pocketeventbridge_collectionevents_nullresource_DC135E6D => null_resource.collection-events_null-resource_9F908E27
  * null_resource.pocketeventbridge_listapievents_nullresource_0986E948 => null_resource.list-api-events_null-resource_D711C801
  * null_resource.pocketeventbridge_premiumpurchase_nullresource_6D67F378 => null_resource.premium-purchase_null-resource_E2C3B0AC
  * null_resource.pocketeventbridge_prospectevents_nullresource_92CE41FC => null_resource.prospect-events_null-resource_BF542108
  * null_resource.pocketeventbridge_shareablelistevents_nullresource_E91C89D8 => null_resource.shareable-list-events_null-resource_78AB9CC2
  * null_resource.pocketeventbridge_shareablelistitemevents_nullresource_B57BD2A5 => null_resource.shareable-list-item-events_null-resource_46056FE2
  * null_resource.pocketeventbridge_userapievents_nullresource_7F96C768 => null_resource.user-api-events_null-resource_C0C836FA
  * null_resource.pocketeventbridge_userregistration_nullresource_F1C77D27 => null_resource.user-registration_null-resource_B04CACC3
  * pagerduty_service.pocketeventbridge_pagerduty_pagerdutycritical_22817B42 => pagerduty_service.pagerduty_pagerduty-critical_464EE7CD
  * pagerduty_service.pocketeventbridge_pagerduty_pagerdutynoncritical_333AFE25 => pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_cloudwatch_event_bus.pocketeventbridge_sharedeventbus_eventbusPocketEventBridgeProdSharedEventBus_5780345A has moved to aws_cloudwatch_event_bus.shared-event-bus_event-bus-PocketEventBridge-Prod-Shared-Event-Bus_AA9ACCF5
    resource "aws_cloudwatch_event_bus" "shared-event-bus_event-bus-PocketEventBridge-Prod-Shared-Event-Bus_AA9ACCF5" {
        id       = "PocketEventBridge-Prod-Shared-Event-Bus"
        name     = "PocketEventBridge-Prod-Shared-Event-Bus"
        tags     = {
            "service" = "PocketEventBridge-Prod"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.pocketeventbridge_admevents_PocketEventBridgeProdEventTrackerEventBridgeRule_eventbridgerule_85435BD0 has moved to aws_cloudwatch_event_rule.adm-events_PocketEventBridge-Prod-EventTracker-EventBridge-Rule_event-bridge-rule_5E518227
    resource "aws_cloudwatch_event_rule" "adm-events_PocketEventBridge-Prod-EventTracker-EventBridge-Rule_event-bridge-rule_5E518227" {
        id                  = "PocketEventBridge-Prod-EventTracker-Rule-Rule"
        name                = "PocketEventBridge-Prod-EventTracker-Rule-Rule"
        tags                = {}
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.pocketeventbridge_admevents_PocketEventBridgeProdUserMergeEventBridgeRule_eventbridgerule_9306063C has moved to aws_cloudwatch_event_rule.adm-events_PocketEventBridge-Prod-UserMerge-EventBridge-Rule_event-bridge-rule_6FA6D274
    resource "aws_cloudwatch_event_rule" "adm-events_PocketEventBridge-Prod-UserMerge-EventBridge-Rule_event-bridge-rule_6FA6D274" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-UserMerge-Rule-Rule"
        name           = "PocketEventBridge-Prod-UserMerge-Rule-Rule"
        tags           = {}
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.pocketeventbridge_collectionevents_PocketEventBridgeProdCollectionApiEventBridgeRule_eventbridgerule_9790D0EF has moved to aws_cloudwatch_event_rule.collection-events_PocketEventBridge-Prod-Collection-Api-EventBridge-Rule_event-bridge-rule_D5C5DE9D
    resource "aws_cloudwatch_event_rule" "collection-events_PocketEventBridge-Prod-Collection-Api-EventBridge-Rule_event-bridge-rule_D5C5DE9D" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-CollectionEvents-Rule-Rule"
        name           = "PocketEventBridge-Prod-CollectionEvents-Rule-Rule"
        tags           = {}
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.pocketeventbridge_listapievents_PocketEventBridgeProdListApiEventBridgeRule_eventbridgerule_AD82EC14 has moved to aws_cloudwatch_event_rule.list-api-events_PocketEventBridge-Prod-List-Api-EventBridge-Rule_event-bridge-rule_AFDFFFC6
    resource "aws_cloudwatch_event_rule" "list-api-events_PocketEventBridge-Prod-List-Api-EventBridge-Rule_event-bridge-rule_AFDFFFC6" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-ListApiEvents-Rule-Rule"
        name           = "PocketEventBridge-Prod-ListApiEvents-Rule-Rule"
        tags           = {}
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.pocketeventbridge_premiumpurchase_PocketEventBridgeProdPremiumPurchaseEventBridgeRule_eventbridgerule_E1ED50AF has moved to aws_cloudwatch_event_rule.premium-purchase_PocketEventBridge-Prod-PremiumPurchase-EventBridge-Rule_event-bridge-rule_ECCD1C94
    resource "aws_cloudwatch_event_rule" "premium-purchase_PocketEventBridge-Prod-PremiumPurchase-EventBridge-Rule_event-bridge-rule_ECCD1C94" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-PremiumPurchase-Rule-Rule"
        name           = "PocketEventBridge-Prod-PremiumPurchase-Rule-Rule"
        tags           = {}
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.pocketeventbridge_prospectevents_PocketEventBridgeProdProspectDismissProdEventBridgeRule_eventbridgerule_8EF4DF44 has moved to aws_cloudwatch_event_rule.prospect-events_PocketEventBridge-Prod-Prospect-Dismiss-Prod-EventBridge-Rule_event-bridge-rule_758CF81E
    resource "aws_cloudwatch_event_rule" "prospect-events_PocketEventBridge-Prod-Prospect-Dismiss-Prod-EventBridge-Rule_event-bridge-rule_758CF81E" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-Prospect-Dismiss-Event-Rule-Rule"
        name           = "PocketEventBridge-Prod-Prospect-Dismiss-Event-Rule-Rule"
        tags           = {}
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.pocketeventbridge_prospectevents_PocketEventBridgeProdProspectProdEventBridgeRule_eventbridgerule_BE199BDE has moved to aws_cloudwatch_event_rule.prospect-events_PocketEventBridge-Prod-Prospect-Prod-EventBridge-Rule_event-bridge-rule_D94A5C82
    resource "aws_cloudwatch_event_rule" "prospect-events_PocketEventBridge-Prod-Prospect-Prod-EventBridge-Rule_event-bridge-rule_D94A5C82" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-ProspectEvents-Rule-Rule"
        name           = "PocketEventBridge-Prod-ProspectEvents-Rule-Rule"
        tags           = {}
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.pocketeventbridge_shareablelistevents_PocketEventBridgeProdShareableListEventBridgeRule_eventbridgerule_C3B1C5AD has moved to aws_cloudwatch_event_rule.shareable-list-events_PocketEventBridge-Prod-Shareable-List-EventBridge-Rule_event-bridge-rule_B3E9B53D
    resource "aws_cloudwatch_event_rule" "shareable-list-events_PocketEventBridge-Prod-Shareable-List-EventBridge-Rule_event-bridge-rule_B3E9B53D" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-ShareableListEvents-Rule-Rule"
        name           = "PocketEventBridge-Prod-ShareableListEvents-Rule-Rule"
        tags           = {}
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.pocketeventbridge_shareablelistitemevents_PocketEventBridgeProdShareableListItemEventBridgeRule_eventbridgerule_D85AA479 has moved to aws_cloudwatch_event_rule.shareable-list-item-events_PocketEventBridge-Prod-Shareable-List-Item-EventBridge-Rule_event-bridge-rule_8124CBA8
    resource "aws_cloudwatch_event_rule" "shareable-list-item-events_PocketEventBridge-Prod-Shareable-List-Item-EventBridge-Rule_event-bridge-rule_8124CBA8" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-ShareableListItemEvents-Rule-Rule"
        name           = "PocketEventBridge-Prod-ShareableListItemEvents-Rule-Rule"
        tags           = {}
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.pocketeventbridge_userapievents_PocketEventBridgeProdUserApiEventBridgeRule_eventbridgerule_95249B28 has moved to aws_cloudwatch_event_rule.user-api-events_PocketEventBridge-Prod-User-Api-EventBridge-Rule_event-bridge-rule_4810C8AC
    resource "aws_cloudwatch_event_rule" "user-api-events_PocketEventBridge-Prod-User-Api-EventBridge-Rule_event-bridge-rule_4810C8AC" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-UserEvents-Rule-Rule"
        name           = "PocketEventBridge-Prod-UserEvents-Rule-Rule"
        tags           = {}
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.pocketeventbridge_userregistration_PocketEventBridgeProdUserRegistrationEventBridgeRule_eventbridgerule_18E9DE51 has moved to aws_cloudwatch_event_rule.user-registration_PocketEventBridge-Prod-User-Registration-EventBridge-Rule_event-bridge-rule_99FC7731
    resource "aws_cloudwatch_event_rule" "user-registration_PocketEventBridge-Prod-User-Registration-EventBridge-Rule_event-bridge-rule_99FC7731" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus/PocketEventBridge-Prod-UserRegistration-Rule-Rule"
        name           = "PocketEventBridge-Prod-UserRegistration-Rule-Rule"
        tags           = {}
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.pocketeventbridge_admevents_PocketEventBridgeProdEventTrackerEventBridgeRule_eventbridgerule_eventbridgetargetAccountDeleteMonitorProdEventTrackerRuleTarget_5EAF513A has moved to aws_cloudwatch_event_target.adm-events_PocketEventBridge-Prod-EventTracker-EventBridge-Rule_event-bridge-rule_event-bridge-target-AccountDeleteMonitor-Prod-EventTracker-Rule-Target_AF1CF51A
    resource "aws_cloudwatch_event_target" "adm-events_PocketEventBridge-Prod-EventTracker-EventBridge-Rule_event-bridge-rule_event-bridge-target-AccountDeleteMonitor-Prod-EventTracker-Rule-Target_AF1CF51A" {
        id             = "PocketEventBridge-Prod-EventTracker-Rule-Rule-AccountDeleteMonitor-Prod-EventTracker-Rule-Target"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_event_target.pocketeventbridge_admevents_PocketEventBridgeProdUserMergeEventBridgeRule_eventbridgerule_eventbridgetargetAccountDeleteMonitorProdUserMergeRuleTarget_3AA65A81 has moved to aws_cloudwatch_event_target.adm-events_PocketEventBridge-Prod-UserMerge-EventBridge-Rule_event-bridge-rule_event-bridge-target-AccountDeleteMonitor-Prod-UserMerge-Rule-Target_7DE5DC1D
    resource "aws_cloudwatch_event_target" "adm-events_PocketEventBridge-Prod-UserMerge-EventBridge-Rule_event-bridge-rule_event-bridge-target-AccountDeleteMonitor-Prod-UserMerge-Rule-Target_7DE5DC1D" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-UserMerge-Rule-Rule-AccountDeleteMonitor-Prod-UserMerge-Rule-Target"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_event_target.pocketeventbridge_collectionevents_PocketEventBridgeProdCollectionApiEventBridgeRule_eventbridgerule_eventbridgetargetPocketEventBridgeProdCollectionEventSNSTarget_E85BE39A has moved to aws_cloudwatch_event_target.collection-events_PocketEventBridge-Prod-Collection-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Collection-Event-SNS-Target_C4E7E46F
    resource "aws_cloudwatch_event_target" "collection-events_PocketEventBridge-Prod-Collection-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Collection-Event-SNS-Target_C4E7E46F" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-CollectionEvents-Rule-Rule-PocketEventBridge-Prod-Collection-Event-SNS-Target"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_event_target.pocketeventbridge_listapievents_PocketEventBridgeProdListApiEventBridgeRule_eventbridgerule_eventbridgetargetPocketEventBridgeProdListEventSNSTarget_D9175105 has moved to aws_cloudwatch_event_target.list-api-events_PocketEventBridge-Prod-List-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-List-Event-SNS-Target_FD139C52
    resource "aws_cloudwatch_event_target" "list-api-events_PocketEventBridge-Prod-List-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-List-Event-SNS-Target_FD139C52" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-ListApiEvents-Rule-Rule-PocketEventBridge-Prod-List-Event-SNS-Target"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_event_target.pocketeventbridge_premiumpurchase_PocketEventBridgeProdPremiumPurchaseEventBridgeRule_eventbridgerule_eventbridgetargetPocketEventBridgeProdPremiumPurchaseSNSTarget_BEBA381B has moved to aws_cloudwatch_event_target.premium-purchase_PocketEventBridge-Prod-PremiumPurchase-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-PremiumPurchase-SNS-Target_A8F33A09
    resource "aws_cloudwatch_event_target" "premium-purchase_PocketEventBridge-Prod-PremiumPurchase-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-PremiumPurchase-SNS-Target_A8F33A09" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-PremiumPurchase-Rule-Rule-PocketEventBridge-Prod-PremiumPurchase-SNS-Target"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_event_target.pocketeventbridge_prospectevents_PocketEventBridgeProdProspectDismissProdEventBridgeRule_eventbridgerule_eventbridgetargetPocketEventBridgeProdProspectEventSNSTarget_45FF665F has moved to aws_cloudwatch_event_target.prospect-events_PocketEventBridge-Prod-Prospect-Dismiss-Prod-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Prospect-Event-SNS-Target_CC89DADA
    resource "aws_cloudwatch_event_target" "prospect-events_PocketEventBridge-Prod-Prospect-Dismiss-Prod-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Prospect-Event-SNS-Target_CC89DADA" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-Prospect-Dismiss-Event-Rule-Rule-PocketEventBridge-Prod-Prospect-Event-SNS-Target"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_event_target.pocketeventbridge_prospectevents_PocketEventBridgeProdProspectProdEventBridgeRule_eventbridgerule_eventbridgetargetPocketEventBridgeProdProspectEventDevEventBridgetTarget_DD25D56B has moved to aws_cloudwatch_event_target.prospect-events_PocketEventBridge-Prod-Prospect-Prod-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Prospect-Event-Dev-Event-Bridget-Target_C4F47897
    resource "aws_cloudwatch_event_target" "prospect-events_PocketEventBridge-Prod-Prospect-Prod-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Prospect-Event-Dev-Event-Bridget-Target_C4F47897" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-ProspectEvents-Rule-Rule-PocketEventBridge-Prod-Prospect-Event-Dev-Event-Bridget-Target"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_event_target.pocketeventbridge_prospectevents_PocketEventBridgeProdProspectProdEventBridgeRule_eventbridgerule_eventbridgetargetPocketEventBridgeProdProspectEventSQSTarget_5FB29389 has moved to aws_cloudwatch_event_target.prospect-events_PocketEventBridge-Prod-Prospect-Prod-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Prospect-Event-SQS-Target_649F5585
    resource "aws_cloudwatch_event_target" "prospect-events_PocketEventBridge-Prod-Prospect-Prod-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Prospect-Event-SQS-Target_649F5585" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-ProspectEvents-Rule-Rule-PocketEventBridge-Prod-Prospect-Event-SQS-Target"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_event_target.pocketeventbridge_shareablelistevents_PocketEventBridgeProdShareableListEventBridgeRule_eventbridgerule_eventbridgetargetPocketEventBridgeProdShareableListEventSNSTarget_2CD4ED13 has moved to aws_cloudwatch_event_target.shareable-list-events_PocketEventBridge-Prod-Shareable-List-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Shareable-List-Event-SNS-Target_D0F547B9
    resource "aws_cloudwatch_event_target" "shareable-list-events_PocketEventBridge-Prod-Shareable-List-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Shareable-List-Event-SNS-Target_D0F547B9" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-ShareableListEvents-Rule-Rule-PocketEventBridge-Prod-Shareable-List-Event-SNS-Target"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_event_target.pocketeventbridge_shareablelistitemevents_PocketEventBridgeProdShareableListItemEventBridgeRule_eventbridgerule_eventbridgetargetPocketEventBridgeProdShareableListItemEventSNSTarget_2AE93962 has moved to aws_cloudwatch_event_target.shareable-list-item-events_PocketEventBridge-Prod-Shareable-List-Item-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Shareable-List-Item-Event-SNS-Target_84030FFD
    resource "aws_cloudwatch_event_target" "shareable-list-item-events_PocketEventBridge-Prod-Shareable-List-Item-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-Shareable-List-Item-Event-SNS-Target_84030FFD" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-ShareableListItemEvents-Rule-Rule-PocketEventBridge-Prod-Shareable-List-Item-Event-SNS-Target"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_event_target.pocketeventbridge_userapievents_PocketEventBridgeProdUserApiEventBridgeRule_eventbridgerule_eventbridgetargetPocketEventBridgeProdUserEventSNSTarget_56DFA070 has moved to aws_cloudwatch_event_target.user-api-events_PocketEventBridge-Prod-User-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-User-Event-SNS-Target_9A50990C
    resource "aws_cloudwatch_event_target" "user-api-events_PocketEventBridge-Prod-User-Api-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-User-Event-SNS-Target_9A50990C" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-UserEvents-Rule-Rule-PocketEventBridge-Prod-User-Event-SNS-Target"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_event_target.pocketeventbridge_userregistration_PocketEventBridgeProdUserRegistrationEventBridgeRule_eventbridgerule_eventbridgetargetPocketEventBridgeProdUserRegistrationEventSNSTarget_3AB833CC has moved to aws_cloudwatch_event_target.user-registration_PocketEventBridge-Prod-User-Registration-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-User-Registration-Event-SNS-Target_D5B6ADE6
    resource "aws_cloudwatch_event_target" "user-registration_PocketEventBridge-Prod-User-Registration-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-User-Registration-Event-SNS-Target_D5B6ADE6" {
        id             = "PocketEventBridge-Prod-Shared-Event-Bus-PocketEventBridge-Prod-UserRegistration-Rule-Rule-PocketEventBridge-Prod-User-Registration-Event-SNS-Target"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_metric_alarm.pocketeventbridge_admevents_pocketeventbridgeproddlqalarm_7C10E75B has moved to aws_cloudwatch_metric_alarm.adm-events_pocketeventbridge-prod-dlq-alarm_D899FDCA
    resource "aws_cloudwatch_metric_alarm" "adm-events_pocketeventbridge-prod-dlq-alarm_D899FDCA" {
        id                        = "PocketEventBridge-Prod-PocketEventBridge-Prod-Dlq-Alarm"
        tags                      = {}
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.pocketeventbridge_collectionevents_collectioneventsruledlqalarm_D0F6DA6A has moved to aws_cloudwatch_metric_alarm.collection-events_collectionevents-rule-dlq-alarm_9543404D
    resource "aws_cloudwatch_metric_alarm" "collection-events_collectionevents-rule-dlq-alarm_9543404D" {
        id                        = "PocketEventBridge-Prod-CollectionEvents-Rule-dlq-alarm"
        tags                      = {}
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.pocketeventbridge_listapievents_listapieventsruledlqalarm_F5C18D51 has moved to aws_cloudwatch_metric_alarm.list-api-events_listapievents-rule-dlq-alarm_9E16078F
    resource "aws_cloudwatch_metric_alarm" "list-api-events_listapievents-rule-dlq-alarm_9E16078F" {
        id                        = "PocketEventBridge-Prod-ListApiEvents-Rule-dlq-alarm"
        tags                      = {}
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.pocketeventbridge_premiumpurchase_premiumpurchaseruledlqalarm_54A7ABD7 has moved to aws_cloudwatch_metric_alarm.premium-purchase_premiumpurchase-rule-dlq-alarm_912E47A2
    resource "aws_cloudwatch_metric_alarm" "premium-purchase_premiumpurchase-rule-dlq-alarm_912E47A2" {
        id                        = "PocketEventBridge-Prod-PremiumPurchase-rule-dlq-alarm"
        tags                      = {}
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.pocketeventbridge_prospectevents_prospecteventsruledlqalarm_0428D8ED has moved to aws_cloudwatch_metric_alarm.prospect-events_prospectevents-rule-dlq-alarm_8841D120
    resource "aws_cloudwatch_metric_alarm" "prospect-events_prospectevents-rule-dlq-alarm_8841D120" {
        id                        = "PocketEventBridge-Prod-ProspectEvents-Rule-DLQ-Alarm"
        tags                      = {}
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.shareable-list-events_shareablelistevents-rule-dlq-alarm_FBCFA70C will be updated in-place
  # (moved from aws_cloudwatch_metric_alarm.pocketeventbridge_shareablelistevents_shareablelisteventsruledlqalarm_2F345E4B)
  ~ resource "aws_cloudwatch_metric_alarm" "shareable-list-events_shareablelistevents-rule-dlq-alarm_FBCFA70C" {
      ~ dimensions                = {
          ~ "QueueName" = "PocketEventBridge-Prod-SNS-ShareableListItemEvents-Topic-DLQ" -> "PocketEventBridge-Prod-SNS-ShareableListEvents-Topic-DLQ"
        }
        id                        = "PocketEventBridge-Prod-ShareableListEvents-Rule-dlq-alarm"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.pocketeventbridge_shareablelistitemevents_shareablelisteventsruledlqalarm_BC540655 has moved to aws_cloudwatch_metric_alarm.shareable-list-item-events_shareablelistevents-rule-dlq-alarm_2CE4E6A3
    resource "aws_cloudwatch_metric_alarm" "shareable-list-item-events_shareablelistevents-rule-dlq-alarm_2CE4E6A3" {
        id                        = "PocketEventBridge-Prod-ShareableListEvents-Rule-dlq-alarm"
        tags                      = {}
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.pocketeventbridge_userapievents_usereventsruledlqalarm_B2FD9FD2 has moved to aws_cloudwatch_metric_alarm.user-api-events_userevents-rule-dlq-alarm_A6972B78
    resource "aws_cloudwatch_metric_alarm" "user-api-events_userevents-rule-dlq-alarm_A6972B78" {
        id                        = "PocketEventBridge-Prod-UserEvents-Rule-dlq-alarm"
        tags                      = {}
        # (18 unchanged attributes hidden)
    }

  # aws_schemas_schema.pocketeventbridge_forgotpasswordrequesteventschema_ForgotPasswordRequestSchema_4EC0A069 has moved to aws_schemas_schema.forgot-password-request-event-schema_Forgot-Password-Request-Schema_F8AD6D8D
    resource "aws_schemas_schema" "forgot-password-request-event-schema_Forgot-Password-Request-Schema_F8AD6D8D" {
        id                   = "Forgot-Password-Request/PocketEventBus"
        name                 = "Forgot-Password-Request"
        tags                 = {}
        # (9 unchanged attributes hidden)
    }

  # aws_schemas_schema.pocketeventbridge_premiumpurchaseeventschema_PremiumPurchaseSchema_DB9F9703 has moved to aws_schemas_schema.premium-purchase-event-schema_Premium-Purchase-Schema_4B186F59
    resource "aws_schemas_schema" "premium-purchase-event-schema_Premium-Purchase-Schema_4B186F59" {
        id                   = "Premium-Purchase/PocketEventBus"
        name                 = "Premium-Purchase"
        tags                 = {}
        # (9 unchanged attributes hidden)
    }

  # aws_schemas_schema.pocketeventbridge_premiumpurchaseeventschema_PremiumRenewalUpcomingSchema_4BD5EB24 has moved to aws_schemas_schema.premium-purchase-event-schema_Premium-Renewal-Upcoming-Schema_8D7B8419
    resource "aws_schemas_schema" "premium-purchase-event-schema_Premium-Renewal-Upcoming-Schema_8D7B8419" {
        id                   = "Premium-Renewal-Upcoming/PocketEventBus"
        name                 = "Premium-Renewal-Upcoming"
        tags                 = {}
        # (9 unchanged attributes hidden)
    }

  # aws_schemas_schema.pocketeventbridge_queuedeleteschema_cron1510schema_24302433 has moved to aws_schemas_schema.queue-delete-schema_cron1510-schema_D11DCA60
    resource "aws_schemas_schema" "queue-delete-schema_cron1510-schema_D11DCA60" {
        id                   = "queue-check-delete/PocketEventBus"
        name                 = "queue-check-delete"
        tags                 = {}
        # (9 unchanged attributes hidden)
    }

  # aws_schemas_schema.pocketeventbridge_userapieventsschema_usereventsschema_328CD894 has moved to aws_schemas_schema.user-api-events-schema_user-events-schema_692DDC33
    resource "aws_schemas_schema" "user-api-events-schema_user-events-schema_692DDC33" {
        id                   = "user-events/PocketEventBus"
        name                 = "user-events"
        tags                 = {}
        # (9 unchanged attributes hidden)
    }

  # aws_schemas_schema.pocketeventbridge_usermergeeventshema_usermergeschema_9563BF72 has moved to aws_schemas_schema.user-merge-event-shema_user-merge-schema_325E4B6B
    resource "aws_schemas_schema" "user-merge-event-shema_user-merge-schema_325E4B6B" {
        id                   = "user-merge/PocketEventBus"
        name                 = "user-merge"
        tags                 = {}
        # (9 unchanged attributes hidden)
    }

  # aws_schemas_schema.pocketeventbridge_userregistrationeventschema_UserRegistrationEventSchema_1BDB0132 has moved to aws_schemas_schema.user-registration-event-schema_User-Registration-Event-Schema_ABDCA1C3
    resource "aws_schemas_schema" "user-registration-event-schema_User-Registration-Event-Schema_ABDCA1C3" {
        id                   = "User-Registration-Event/PocketEventBus"
        name                 = "User-Registration-Event"
        tags                 = {}
        # (9 unchanged attributes hidden)
    }

  # aws_sns_topic.pocketeventbridge_admevents_usermergetopic_DEB7603D has moved to aws_sns_topic.adm-events_user-merge-topic_59FD8EDC
    resource "aws_sns_topic" "adm-events_user-merge-topic_59FD8EDC" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserMerge-Topic"
        name                                     = "PocketEventBridge-Prod-UserMerge-Topic"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic.pocketeventbridge_collectionevents_collectioneventtopic_2974C8EE has moved to aws_sns_topic.collection-events_collection-event-topic_343F754D
    resource "aws_sns_topic" "collection-events_collection-event-topic_343F754D" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic"
        name                                     = "PocketEventBridge-Prod-CollectionEventTopic"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic.pocketeventbridge_listapievents_listeventtopic_BC616D31 has moved to aws_sns_topic.list-api-events_list-event-topic_8792A1B3
    resource "aws_sns_topic" "list-api-events_list-event-topic_8792A1B3" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEventTopic"
        name                                     = "PocketEventBridge-Prod-ListEventTopic"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic.pocketeventbridge_pagerduty_alarmcriticaltopic_9AC2FC17 has moved to aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
    resource "aws_sns_topic" "pagerduty_alarm-critical-topic_F1534579" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Critical"
        name                                     = "PocketEventBridge-Prod-Infrastructure-Alarm-Critical"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic.pocketeventbridge_pagerduty_alarmnoncriticaltopic_5D53E7FA has moved to aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
    resource "aws_sns_topic" "pagerduty_alarm-non-critical-topic_53C1A3B3" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Non-Critical"
        name                                     = "PocketEventBridge-Prod-Infrastructure-Alarm-Non-Critical"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic.pocketeventbridge_premiumpurchase_premiumpurchasetopic_F377CBA5 has moved to aws_sns_topic.premium-purchase_premium-purchase-topic_B49B01E4
    resource "aws_sns_topic" "premium-purchase_premium-purchase-topic_B49B01E4" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchase-Topic"
        name                                     = "PocketEventBridge-Prod-PremiumPurchase-Topic"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic.pocketeventbridge_prospectevents_prospecteventtopic_9280FCAE has moved to aws_sns_topic.prospect-events_prospect-event-topic_59EF07AC
    resource "aws_sns_topic" "prospect-events_prospect-event-topic_59EF07AC" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ProspectEventTopic"
        name                                     = "PocketEventBridge-Prod-ProspectEventTopic"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic.pocketeventbridge_shareablelistevents_shareablelisteventtopic_4B2730C8 has moved to aws_sns_topic.shareable-list-events_shareable-list-event-topic_0122F098
    resource "aws_sns_topic" "shareable-list-events_shareable-list-event-topic_0122F098" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEventTopic"
        name                                     = "PocketEventBridge-Prod-ShareableListEventTopic"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic.pocketeventbridge_shareablelistitemevents_shareablelistitemeventtopic_8B9E00A4 has moved to aws_sns_topic.shareable-list-item-events_shareable-list-item-event-topic_C6825838
    resource "aws_sns_topic" "shareable-list-item-events_shareable-list-item-event-topic_C6825838" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEventTopic"
        name                                     = "PocketEventBridge-Prod-ShareableListItemEventTopic"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic.pocketeventbridge_userapievents_usereventtopic_9E64E1FA has moved to aws_sns_topic.user-api-events_user-event-topic_BF85AC87
    resource "aws_sns_topic" "user-api-events_user-event-topic_BF85AC87" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic"
        name                                     = "PocketEventBridge-Prod-UserEventTopic"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic.pocketeventbridge_userregistration_userregistrationtopic_505053B5 has moved to aws_sns_topic.user-registration_user-registration-topic_1A7AE012
    resource "aws_sns_topic" "user-registration_user-registration-topic_1A7AE012" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationTopic"
        name                                     = "PocketEventBridge-Prod-UserRegistrationTopic"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.pocketeventbridge_admevents_usereventssnstopicpolicy_13889830 has moved to aws_sns_topic_policy.adm-events_user-events-sns-topic-policy_311E9FD7
    resource "aws_sns_topic_policy" "adm-events_user-events-sns-topic-policy_311E9FD7" {
        id     = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserMerge-Topic"
        # (3 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.pocketeventbridge_collectionevents_collectioneventssnstopicpolicy_09809F3F has moved to aws_sns_topic_policy.collection-events_collection-events-sns-topic-policy_65FE0430
    resource "aws_sns_topic_policy" "collection-events_collection-events-sns-topic-policy_65FE0430" {
        id     = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic"
        # (3 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.pocketeventbridge_listapievents_listeventssnstopicpolicy_FC1C0842 has moved to aws_sns_topic_policy.list-api-events_list-events-sns-topic-policy_59B53E09
    resource "aws_sns_topic_policy" "list-api-events_list-events-sns-topic-policy_59B53E09" {
        id     = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ListEventTopic"
        # (3 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.pocketeventbridge_premiumpurchase_premiumpurchasesnstopicpolicy_D8AD1C37 has moved to aws_sns_topic_policy.premium-purchase_premium-purchase-sns-topic-policy_DDFFEF7C
    resource "aws_sns_topic_policy" "premium-purchase_premium-purchase-sns-topic-policy_DDFFEF7C" {
        id     = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-PremiumPurchase-Topic"
        # (3 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.pocketeventbridge_prospectevents_prospecteventssnstopicpolicy_F6F78D39 has moved to aws_sns_topic_policy.prospect-events_prospect-events-sns-topic-policy_8C3D6AD1
    resource "aws_sns_topic_policy" "prospect-events_prospect-events-sns-topic-policy_8C3D6AD1" {
        id     = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ProspectEventTopic"
        # (3 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.pocketeventbridge_shareablelistevents_shareablelisteventssnstopicpolicy_387E1A3C has moved to aws_sns_topic_policy.shareable-list-events_shareable-list-events-sns-topic-policy_1352CBFE
    resource "aws_sns_topic_policy" "shareable-list-events_shareable-list-events-sns-topic-policy_1352CBFE" {
        id     = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEventTopic"
        # (3 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.pocketeventbridge_shareablelistitemevents_shareablelistitemeventssnstopicpolicy_5A1FEF5D has moved to aws_sns_topic_policy.shareable-list-item-events_shareable-list-item-events-sns-topic-policy_7C39759F
    resource "aws_sns_topic_policy" "shareable-list-item-events_shareable-list-item-events-sns-topic-policy_7C39759F" {
        id     = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEventTopic"
        # (3 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.pocketeventbridge_userapievents_usereventssnstopicpolicy_EEB8C27E has moved to aws_sns_topic_policy.user-api-events_user-events-sns-topic-policy_0B7C8128
    resource "aws_sns_topic_policy" "user-api-events_user-events-sns-topic-policy_0B7C8128" {
        id     = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic"
        # (3 unchanged attributes hidden)
    }

  # aws_sns_topic_policy.pocketeventbridge_userregistration_userregistrationeventssnstopicpolicy_DE9F2864 has moved to aws_sns_topic_policy.user-registration_user-registration-events-sns-topic-policy_15EC0C3C
    resource "aws_sns_topic_policy" "user-registration_user-registration-events-sns-topic-policy_15EC0C3C" {
        id     = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserRegistrationTopic"
        # (3 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84 must be replaced
  # (moved from aws_sns_topic_subscription.pocketeventbridge_pagerduty_alarmcriticalsubscription_5B282F58)
-/+ resource "aws_sns_topic_subscription" "pagerduty_alarm-critical-subscription_E2168B84" {
      ~ arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Critical:43fcae3a-4102-4d05-9762-2a77e739c417" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      ~ endpoint                        = "https://events.pagerduty.com/integration/7427f9a5d3854a02c0b8c30b7030a2d3/enqueue" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Critical:43fcae3a-4102-4d05-9762-2a77e739c417" -> (known after apply)
      ~ owner_id                        = "996905175585" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B must be replaced
  # (moved from aws_sns_topic_subscription.pocketeventbridge_pagerduty_alarmnoncriticalsubscription_E2C2944C)
-/+ resource "aws_sns_topic_subscription" "pagerduty_alarm-non-critical-subscription_4702677B" {
      ~ arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Non-Critical:79ed7c1b-2cb9-4cf2-b1d9-18f178abe858" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      ~ endpoint                        = "https://events.pagerduty.com/integration/0172408fce6c490ec0a6a42ce381b946/enqueue" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Non-Critical:79ed7c1b-2cb9-4cf2-b1d9-18f178abe858" -> (known after apply)
      ~ owner_id                        = "996905175585" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_admevents_snstopicdql_43476306 has moved to aws_sqs_queue.adm-events_sns-topic-dql_3950AFFB
    resource "aws_sqs_queue" "adm-events_sns-topic-dql_3950AFFB" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-UserMerge-SNS-Topic-DLQ"
        name                              = "PocketEventBridge-Prod-UserMerge-SNS-Topic-DLQ"
        tags                              = {
            "environment" = "Prod"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_collectionevents_snstopicdql_6B11F7F7 has moved to aws_sqs_queue.collection-events_sns-topic-dql_48DE5FA3
    resource "aws_sqs_queue" "collection-events_sns-topic-dql_48DE5FA3" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-CollectionEvents-Event-Rule-DLQ"
        name                              = "PocketEventBridge-Prod-SNS-CollectionEvents-Event-Rule-DLQ"
        tags                              = {
            "environment" = "Prod"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_listapievents_snstopicdql_0098EEA6 has moved to aws_sqs_queue.list-api-events_sns-topic-dql_ED0C2F54
    resource "aws_sqs_queue" "list-api-events_sns-topic-dql_ED0C2F54" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-ListApiEvents-Topic-Rule-DLQ"
        name                              = "PocketEventBridge-Prod-ListApiEvents-Topic-Rule-DLQ"
        tags                              = {
            "environment" = "Prod"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_premiumpurchase_snstopicdlq_1949C943 has moved to aws_sqs_queue.premium-purchase_sns-topic-dlq_2D01673E
    resource "aws_sqs_queue" "premium-purchase_sns-topic-dlq_2D01673E" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-PremiumPurchase-SNS-Topic-Event-Rule-DLQ"
        name                              = "PocketEventBridge-Prod-PremiumPurchase-SNS-Topic-Event-Rule-DLQ"
        tags                              = {
            "environment" = "Prod"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_shareablelistevents_snstopicdql_49BECACA has moved to aws_sqs_queue.shareable-list-events_sns-topic-dql_91DFF5B3
    resource "aws_sqs_queue" "shareable-list-events_sns-topic-dql_91DFF5B3" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-ShareableListEvents-Topic-DLQ"
        name                              = "PocketEventBridge-Prod-SNS-ShareableListEvents-Topic-DLQ"
        tags                              = {
            "environment" = "Prod"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_shareablelistitemevents_snstopicdql_D0F47B59 has moved to aws_sqs_queue.shareable-list-item-events_sns-topic-dql_44435A2F
    resource "aws_sqs_queue" "shareable-list-item-events_sns-topic-dql_44435A2F" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-ShareableListItemEvents-Topic-DLQ"
        name                              = "PocketEventBridge-Prod-SNS-ShareableListItemEvents-Topic-DLQ"
        tags                              = {
            "environment" = "Prod"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_userapievents_snstopicdql_A0F6EC9F has moved to aws_sqs_queue.user-api-events_sns-topic-dql_D6161F53
    resource "aws_sqs_queue" "user-api-events_sns-topic-dql_D6161F53" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-UserEvents-Topic-Rule-DLQ"
        name                              = "PocketEventBridge-Prod-UserEvents-Topic-Rule-DLQ"
        tags                              = {
            "environment" = "Prod"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.pocketeventbridge_userregistration_snstopicdql_5EDA4814 has moved to aws_sqs_queue.user-registration_sns-topic-dql_811A5411
    resource "aws_sqs_queue" "user-registration_sns-topic-dql_811A5411" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/PocketEventBridge-Prod-SNS-UserRegistration-Topic--DLQ"
        name                              = "PocketEventBridge-Prod-SNS-UserRegistration-Topic--DLQ"
        tags                              = {
            "environment" = "Prod"
            "service"     = "PocketEventBridge"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.pocketeventbridge_prospectevents_prospecteventssqspolicy_B5651E17 has moved to aws_sqs_queue_policy.prospect-events_prospect-events-sqs-policy_5D878A3E
    resource "aws_sqs_queue_policy" "prospect-events_prospect-events-sqs-policy_5D878A3E" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/ProspectAPI-Prod-Sqs-Translation-Queue"
        # (2 unchanged attributes hidden)
    }

  # null_resource.pocketeventbridge_admevents_nullresource_582607DC has moved to null_resource.adm-events_null-resource_C7D19F6F
    resource "null_resource" "adm-events_null-resource_C7D19F6F" {
        id = "5907751578904588335"
    }

  # null_resource.pocketeventbridge_collectionevents_nullresource_DC135E6D has moved to null_resource.collection-events_null-resource_9F908E27
    resource "null_resource" "collection-events_null-resource_9F908E27" {
        id = "7083867980005228814"
    }

  # null_resource.pocketeventbridge_listapievents_nullresource_0986E948 has moved to null_resource.list-api-events_null-resource_D711C801
    resource "null_resource" "list-api-events_null-resource_D711C801" {
        id = "1177664838478028438"
    }

  # null_resource.pocketeventbridge_premiumpurchase_nullresource_6D67F378 has moved to null_resource.premium-purchase_null-resource_E2C3B0AC
    resource "null_resource" "premium-purchase_null-resource_E2C3B0AC" {
        id = "8590974618707730681"
    }

  # null_resource.pocketeventbridge_prospectevents_nullresource_92CE41FC has moved to null_resource.prospect-events_null-resource_BF542108
    resource "null_resource" "prospect-events_null-resource_BF542108" {
        id = "1286103112814733777"
    }

  # null_resource.pocketeventbridge_shareablelistevents_nullresource_E91C89D8 has moved to null_resource.shareable-list-events_null-resource_78AB9CC2
    resource "null_resource" "shareable-list-events_null-resource_78AB9CC2" {
        id = "7244420153938391428"
    }

  # null_resource.pocketeventbridge_shareablelistitemevents_nullresource_B57BD2A5 has moved to null_resource.shareable-list-item-events_null-resource_46056FE2
    resource "null_resource" "shareable-list-item-events_null-resource_46056FE2" {
        id = "7377342030826013425"
    }

  # null_resource.user-api-events will be created
  + resource "null_resource" "user-api-events" {
      + id = (known after apply)
    }

  # null_resource.pocketeventbridge_userapievents_nullresource_7F96C768 has moved to null_resource.user-api-events_null-resource_C0C836FA
    resource "null_resource" "user-api-events_null-resource_C0C836FA" {
        id = "4119566737246291003"
    }

  # null_resource.user-registration will be created
  + resource "null_resource" "user-registration" {
      + id = (known after apply)
    }

  # null_resource.pocketeventbridge_userregistration_nullresource_F1C77D27 has moved to null_resource.user-registration_null-resource_B04CACC3
    resource "null_resource" "user-registration_null-resource_B04CACC3" {
        id = "1347031598725150988"
    }

  # pagerduty_service.pagerduty_pagerduty-critical_464EE7CD will be updated in-place
  # (moved from pagerduty_service.pocketeventbridge_pagerduty_pagerdutycritical_22817B42)
  ~ resource "pagerduty_service" "pagerduty_pagerduty-critical_464EE7CD" {
      ~ acknowledgement_timeout = "600" -> "1800"
        id                      = "PDZUG2E"
        name                    = "PocketEventBridge-Prod-PagerDuty-Critical"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938 will be updated in-place
  # (moved from pagerduty_service.pocketeventbridge_pagerduty_pagerdutynoncritical_333AFE25)
  ~ resource "pagerduty_service" "pagerduty_pagerduty-non-critical_B4CB3938" {
      ~ acknowledgement_timeout = "600" -> "1800"
        id                      = "PH8FGF4"
        name                    = "PocketEventBridge-Prod-PagerDuty-Non-Critical"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "PDZUG2E"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "PH8FGF4"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "PDZUG2E"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "PH8FGF4"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281critical_A02019A8 will be destroyed
  # (because pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281critical_A02019A8 is not in configuration)
  - resource "pagerduty_service_integration" "pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281critical_A02019A8" {
      - html_url        = "https://mozilla.pagerduty.com/services/PDZUG2E/integrations/PTQTW8M" -> null
      - id              = "PTQTW8M" -> null
      - integration_key = "7427f9a5d3854a02c0b8c30b7030a2d3" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PDZUG2E" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281noncritical_CDE4BAD7 will be destroyed
  # (because pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281noncritical_CDE4BAD7 is not in configuration)
  - resource "pagerduty_service_integration" "pocketeventbridge_pagerduty_pocketeventbridgepagerdutycloudwatch18574281noncritical_CDE4BAD7" {
      - html_url        = "https://mozilla.pagerduty.com/services/PH8FGF4/integrations/P94HUH9" -> null
      - id              = "P94HUH9" -> null
      - integration_key = "0172408fce6c490ec0a6a42ce381b946" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PH8FGF4" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78critical_3C026715 will be destroyed
  # (because pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78critical_3C026715 is not in configuration)
  - resource "pagerduty_service_integration" "pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78critical_3C026715" {
      - html_url        = "https://mozilla.pagerduty.com/services/PDZUG2E/integrations/PPE5VWZ" -> null
      - id              = "PPE5VWZ" -> null
      - integration_key = "e966b75898e24b01d01e42104f6221aa" -> null
      - name            = "Sentry" -> null
      - service         = "PDZUG2E" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78noncritical_1E770FF0 will be destroyed
  # (because pagerduty_service_integration.pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78noncritical_1E770FF0 is not in configuration)
  - resource "pagerduty_service_integration" "pocketeventbridge_pagerduty_pocketeventbridgepagerdutysentry83E4BA78noncritical_1E770FF0" {
      - html_url        = "https://mozilla.pagerduty.com/services/PH8FGF4/integrations/P5VWU4J" -> null
      - id              = "P5VWU4J" -> null
      - integration_key = "0773820ae3694f09d069d4f5cbf06ec0" -> null
      - name            = "Sentry" -> null
      - service         = "PH8FGF4" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

Plan: 8 to add, 3 to change, 6 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"0de2e9b4-24e9-42d1-beef-36a8b3e8689d","JobName":"pocket-event-bridge_infrastructure_plan_prod","PRNumber":94,"Program":"tfcmt","SHA1":"c6ea51dc1d56d05a6ae70588027bb37c25fc429e","Target":"pocket-event-bridge-cdk","Vars":{}} -->